
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/096b7b69-47c4-40b8-ab91-4867c9620271/terraform-bin plan -no-color
2024-05-16T04:23:28.121Z [INFO]  Terraform version: 1.8.1
2024-05-16T04:23:28.121Z [INFO]  Go runtime version: go1.22.1
2024-05-16T04:23:28.121Z [INFO]  CLI args: []string{"/home/runner/work/_temp/096b7b69-47c4-40b8-ab91-4867c9620271/terraform-bin", "plan", "-no-color"}
2024-05-16T04:23:28.121Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-05-16T04:23:28.127Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=8c98de90-8582-9790-cb01-37998c726041 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-05-16T04:23:28.689Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=8c98de90-8582-9790-cb01-37998c726041 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-16T04:23:28.824Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=8c98de90-8582-9790-cb01-37998c726041 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-16T04:23:29.161Z [INFO]  backend/local: starting Plan operation
2024-05-16T04:23:29.745Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=fe65298f-ec28-b59c-8ac6-32da5b9b5172 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-16T04:23:30.048Z [INFO]  provider: configuring client automatic mTLS
2024-05-16T04:23:30.137Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-16T04:23:30.137Z
2024-05-16T04:23:30.776Z [INFO]  provider: configuring client automatic mTLS
2024-05-16T04:23:30.866Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-16T04:23:30.866Z
2024-05-16T04:23:30.996Z [INFO]  backend/local: plan calling Plan
2024-05-16T04:23:31.001Z [INFO]  provider: configuring client automatic mTLS
2024-05-16T04:23:31.085Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-16T04:23:31.084Z
2024-05-16T04:23:31.195Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_rpc=ConfigureProvider tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=62ae2109-391b-8b4c-0010-d869c9d8f9a4 @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials timestamp=2024-05-16T04:23:31.195Z
2024-05-16T04:23:31.765Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=62ae2109-391b-8b4c-0010-d869c9d8f9a4 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-05-16T04:23:31.765Z
data.aws_iam_policy_document.rds_management_policy_doc: Reading...
data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_iam_policy_document.asg_management_policy_doc: Reading...
2024-05-16T04:23:31.777Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.scale_in_log_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .skip_destroy: planned value cty.False for a non-computed attribute
2024-05-16T04:23:31.778Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_rule.scale_in_rule, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_destroy: planned value cty.False for a non-computed attribute
      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute
2024-05-16T04:23:31.778Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_rule.scale_out_rule, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_destroy: planned value cty.False for a non-computed attribute
      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute
data.aws_iam_policy_document.asg_management_policy_doc: Read complete after 0s [id=4264585230]
2024-05-16T04:23:31.778Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
data.aws_iam_policy_document.rds_management_policy_doc: Read complete after 0s [id=504933363]
2024-05-16T04:23:31.779Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.scale_out_log_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .skip_destroy: planned value cty.False for a non-computed attribute
aws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]
aws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]
aws_iam_role.lambda_role: Refreshing state... [id=algosolved-lambda-role]
2024-05-16T04:23:31.781Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
2024-05-16T04:23:32.237Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.asg_management_policy during refresh.
      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)
2024-05-16T04:23:32.239Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.asg_management_policy, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
2024-05-16T04:23:32.246Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.rds_management_policy during refresh.
      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)
2024-05-16T04:23:32.248Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.rds_management_policy, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
2024-05-16T04:23:32.315Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.lambda_role during refresh.
      - .managed_policy_arns: actual set element cty.StringVal("arn:aws:iam::471112990651:policy/rds-management-policy") does not correlate with any element in plan
      - .managed_policy_arns: length changed from 1 to 2
2024-05-16T04:23:32.317Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.lambda_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .force_detach_policies: planned value cty.False for a non-computed attribute
      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .permissions_boundary: planned value cty.StringVal("") for a non-computed attribute
      - .path: planned value cty.StringVal("/") for a non-computed attribute
aws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145856309600000001]
aws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145946165200000001]
2024-05-16T04:23:32.323Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_in_lambda, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .publish: planned value cty.False for a non-computed attribute
      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute
      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute
      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-16T04:23:32.324Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_out_lambda, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute
      - .publish: planned value cty.False for a non-computed attribute
      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute
      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-16T04:23:32.327Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_target.scale_in_target, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute
2024-05-16T04:23:32.328Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_target.scale_out_target, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute
data.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]
2024-05-16T04:23:32.765Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-16T04:23:32.778Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_delete: planned value cty.False for a non-computed attribute
      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
      - .mixed_instances_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-16T04:23:32.791Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.algosolved-ec2-asg will be created
  + resource "aws_autoscaling_group" "algosolved-ec2-asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 0
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "algosolved-ec2-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-02a53b7890c322346",
          + "subnet-048b8c0b0d0c912b2",
          + "subnet-05c85f1be65b09802",
          + "subnet-06c7c601881a79996",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Project"
          + propagate_at_launch = true
          + value               = "algosolved"
        }
      + tag {
          + key                 = "Stage"
          + propagate_at_launch = true
          + value               = "prod"
        }
    }

  # aws_cloudwatch_event_rule.scale_in_rule will be created
  + resource "aws_cloudwatch_event_rule" "scale_in_rule" {
      + arn            = (known after apply)
      + description    = "Event bridge scale-in lambda"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail    = {
                  + Action               = [
                      + "stop",
                    ]
                  + AutoScalingGroupName = [
                      + "algosolved-ec2-asg",
                    ]
                  + DesiredCapacity      = [
                      + 0,
                    ]
                }
              + resources = [
                  + "arn:aws:rds:us-west-2:123456789012:db:algosolved-rds",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "scale-in-rule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_rule.scale_out_rule will be created
  + resource "aws_cloudwatch_event_rule" "scale_out_rule" {
      + arn            = (known after apply)
      + description    = "Event bridge scale-out lambda"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail = {
                  + AutoScalingGroupName = [
                      + "algosolved-ec2-asg",
                    ]
                  + DesiredCapacity      = [
                      + 1,
                    ]
                }
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "scale-out-rule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.scale_in_target will be created
  + resource "aws_cloudwatch_event_target" "scale_in_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "scale-in-rule"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.scale_out_target will be created
  + resource "aws_cloudwatch_event_target" "scale_out_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "scale-out-rule"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.scale_in_log_group will be created
  + resource "aws_cloudwatch_log_group" "scale_in_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/scale_in/lambda_function.py"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.scale_out_log_group will be created
  + resource "aws_cloudwatch_log_group" "scale_out_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/scale_out/lambda_function.py"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecr_repository.algosolved_repository will be created
  + resource "aws_ecr_repository" "algosolved_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "algosolved-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
    }

  # aws_lambda_function.scale_in_lambda will be created
  + resource "aws_lambda_function" "scale_in_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./scale_in/lambda_function.py.zip"
      + function_name                  = "scale_in_lambda"
      + handler                        = "lambda_function.py.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::471112990651:role/algosolved-lambda-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "GEbiGSU2uxO+/MHbvRbaoTND3TjBrshW8r/mRoI6jrw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CreateDate" = "2024-05-14"
          + "Name"       = "lambda_function.py"
          + "Resource"   = "lambda"
        }
      + tags_all                       = {
          + "CreateDate" = "2024-05-14"
          + "Name"       = "lambda_function.py"
          + "Resource"   = "lambda"
        }
      + timeout                        = 600
      + version                        = (known after apply)
    }

  # aws_lambda_function.scale_out_lambda will be created
  + resource "aws_lambda_function" "scale_out_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./scale_out/lambda_function.py.zip"
      + function_name                  = "scale_out_lambda"
      + handler                        = "lambda_function.py.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::471112990651:role/algosolved-lambda-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "3KXOkpVzdzFCQm8WhmiRLKovDix3a1UX/6KYy43SxEk="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CreateDate" = "2024-05-14"
          + "Name"       = "lambda_function.py"
          + "Resource"   = "lambda"
        }
      + tags_all                       = {
          + "CreateDate" = "2024-05-14"
          + "Name"       = "lambda_function.py"
          + "Resource"   = "lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)
    }

  # aws_lambda_permission.scale_in_lambda_perm will be created
  + resource "aws_lambda_permission" "scale_in_lambda_perm" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "scale_in_lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.scale_out_lambda_perm will be created
  + resource "aws_lambda_permission" "scale_out_lambda_perm" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "scale_out_lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_launch_template.algosolved-lt will be created
  + resource "aws_launch_template" "algosolved-lt" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "This is ASG for Algosolved EC2 instances."
      + id                     = (known after apply)
      + image_id               = "ami-00dade17b7cbec931"
      + instance_type          = "t2.micro"
      + key_name               = "algosolved-ec2-key"
      + latest_version         = (known after apply)
      + name                   = "algosolved-launch-template"
      + name_prefix            = (known after apply)
      + tags                   = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all               = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 50
              + volume_type = "gp3"
            }
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Project" = "algosolved"
              + "Stage"   = "prod"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Project" = "algosolved"
              + "Stage"   = "prod"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Project" = "algosolved"
              + "Stage"   = "prod"
            }
        }
    }

  # aws_security_group.algosolved-ec2-sg will be created
  + resource "aws_security_group" "algosolved-ec2-sg" {
      + arn                    = (known after apply)
      + description            = "Allow vpc network"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow egress from all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ingress from all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "algosolved-ec2-sgp"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all               = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_id                 = "vpc-0f87a26ea18c1b807"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + latest_ami_id = "ami-00dade17b7cbec931"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.rds_management_policy_doc: Reading...%0Adata.aws_iam_policy_document.lambda_assume_role_policy: Reading...%0Adata.aws_ami.ubuntu: Reading...%0Adata.aws_iam_policy_document.asg_management_policy_doc: Reading...%0Adata.aws_iam_policy_document.asg_management_policy_doc: Read complete after 0s [id=4264585230]%0Adata.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]%0Adata.aws_iam_policy_document.rds_management_policy_doc: Read complete after 0s [id=504933363]%0Aaws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]%0Aaws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]%0Aaws_iam_role.lambda_role: Refreshing state... [id=algosolved-lambda-role]%0Aaws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145856309600000001]%0Aaws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145946165200000001]%0Adata.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_autoscaling_group.algosolved-ec2-asg will be created%0A  + resource "aws_autoscaling_group" "algosolved-ec2-asg" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = 0%0A      + force_delete                     = false%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 300%0A      + health_check_type                = (known after apply)%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_size                         = 3%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 0%0A      + name                             = "algosolved-ec2-asg"%0A      + name_prefix                      = (known after apply)%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + vpc_zone_identifier              = [%0A          + "subnet-02a53b7890c322346",%0A          + "subnet-048b8c0b0d0c912b2",%0A          + "subnet-05c85f1be65b09802",%0A          + "subnet-06c7c601881a79996",%0A        ]%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = "$Latest"%0A        }%0A%0A      + tag {%0A          + key                 = "Project"%0A          + propagate_at_launch = true%0A          + value               = "algosolved"%0A        }%0A      + tag {%0A          + key                 = "Stage"%0A          + propagate_at_launch = true%0A          + value               = "prod"%0A        }%0A    }%0A%0A  # aws_cloudwatch_event_rule.scale_in_rule will be created%0A  + resource "aws_cloudwatch_event_rule" "scale_in_rule" {%0A      + arn            = (known after apply)%0A      + description    = "Event bridge scale-in lambda"%0A      + event_bus_name = "default"%0A      + event_pattern  = jsonencode(%0A            {%0A              + detail    = {%0A                  + Action               = [%0A                      + "stop",%0A                    ]%0A                  + AutoScalingGroupName = [%0A                      + "algosolved-ec2-asg",%0A                    ]%0A                  + DesiredCapacity      = [%0A                      + 0,%0A                    ]%0A                }%0A              + resources = [%0A                  + "arn:aws:rds:us-west-2:123456789012:db:algosolved-rds",%0A                ]%0A            }%0A        )%0A      + force_destroy  = false%0A      + id             = (known after apply)%0A      + name           = "scale-in-rule"%0A      + name_prefix    = (known after apply)%0A      + tags_all       = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_event_rule.scale_out_rule will be created%0A  + resource "aws_cloudwatch_event_rule" "scale_out_rule" {%0A      + arn            = (known after apply)%0A      + description    = "Event bridge scale-out lambda"%0A      + event_bus_name = "default"%0A      + event_pattern  = jsonencode(%0A            {%0A              + detail = {%0A                  + AutoScalingGroupName = [%0A                      + "algosolved-ec2-asg",%0A                    ]%0A                  + DesiredCapacity      = [%0A                      + 1,%0A                    ]%0A                }%0A            }%0A        )%0A      + force_destroy  = false%0A      + id             = (known after apply)%0A      + name           = "scale-out-rule"%0A      + name_prefix    = (known after apply)%0A      + tags_all       = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_event_target.scale_in_target will be created%0A  + resource "aws_cloudwatch_event_target" "scale_in_target" {%0A      + arn            = (known after apply)%0A      + event_bus_name = "default"%0A      + id             = (known after apply)%0A      + rule           = "scale-in-rule"%0A      + target_id      = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_event_target.scale_out_target will be created%0A  + resource "aws_cloudwatch_event_target" "scale_out_target" {%0A      + arn            = (known after apply)%0A      + event_bus_name = "default"%0A      + id             = (known after apply)%0A      + rule           = "scale-out-rule"%0A      + target_id      = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_log_group.scale_in_log_group will be created%0A  + resource "aws_cloudwatch_log_group" "scale_in_log_group" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/lambda/scale_in/lambda_function.py"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 14%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_log_group.scale_out_log_group will be created%0A  + resource "aws_cloudwatch_log_group" "scale_out_log_group" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/lambda/scale_out/lambda_function.py"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 14%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0A  # aws_ecr_repository.algosolved_repository will be created%0A  + resource "aws_ecr_repository" "algosolved_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "algosolved-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A    }%0A%0A  # aws_lambda_function.scale_in_lambda will be created%0A  + resource "aws_lambda_function" "scale_in_lambda" {%0A      + architectures                  = (known after apply)%0A      + arn                            = (known after apply)%0A      + filename                       = "./scale_in/lambda_function.py.zip"%0A      + function_name                  = "scale_in_lambda"%0A      + handler                        = "lambda_function.py.lambda_handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = false%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = "arn:aws:iam::471112990651:role/algosolved-lambda-role"%0A      + runtime                        = "python3.12"%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = "GEbiGSU2uxO+/MHbvRbaoTND3TjBrshW8r/mRoI6jrw="%0A      + source_code_size               = (known after apply)%0A      + tags                           = {%0A          + "CreateDate" = "2024-05-14"%0A          + "Name"       = "lambda_function.py"%0A          + "Resource"   = "lambda"%0A        }%0A      + tags_all                       = {%0A          + "CreateDate" = "2024-05-14"%0A          + "Name"       = "lambda_function.py"%0A          + "Resource"   = "lambda"%0A        }%0A      + timeout                        = 600%0A      + version                        = (known after apply)%0A    }%0A%0A  # aws_lambda_function.scale_out_lambda will be created%0A  + resource "aws_lambda_function" "scale_out_lambda" {%0A      + architectures                  = (known after apply)%0A      + arn                            = (known after apply)%0A      + filename                       = "./scale_out/lambda_function.py.zip"%0A      + function_name                  = "scale_out_lambda"%0A      + handler                        = "lambda_function.py.lambda_handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = false%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = "arn:aws:iam::471112990651:role/algosolved-lambda-role"%0A      + runtime                        = "python3.12"%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = "3KXOkpVzdzFCQm8WhmiRLKovDix3a1UX/6KYy43SxEk="%0A      + source_code_size               = (known after apply)%0A      + tags                           = {%0A          + "CreateDate" = "2024-05-14"%0A          + "Name"       = "lambda_function.py"%0A          + "Resource"   = "lambda"%0A        }%0A      + tags_all                       = {%0A          + "CreateDate" = "2024-05-14"%0A          + "Name"       = "lambda_function.py"%0A          + "Resource"   = "lambda"%0A        }%0A      + timeout                        = 30%0A      + version                        = (known after apply)%0A    }%0A%0A  # aws_lambda_permission.scale_in_lambda_perm will be created%0A  + resource "aws_lambda_permission" "scale_in_lambda_perm" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "scale_in_lambda"%0A      + id                  = (known after apply)%0A      + principal           = "events.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # aws_lambda_permission.scale_out_lambda_perm will be created%0A  + resource "aws_lambda_permission" "scale_out_lambda_perm" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "scale_out_lambda"%0A      + id                  = (known after apply)%0A      + principal           = "events.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # aws_launch_template.algosolved-lt will be created%0A  + resource "aws_launch_template" "algosolved-lt" {%0A      + arn                    = (known after apply)%0A      + default_version        = (known after apply)%0A      + description            = "This is ASG for Algosolved EC2 instances."%0A      + id                     = (known after apply)%0A      + image_id               = "ami-00dade17b7cbec931"%0A      + instance_type          = "t2.micro"%0A      + key_name               = "algosolved-ec2-key"%0A      + latest_version         = (known after apply)%0A      + name                   = "algosolved-launch-template"%0A      + name_prefix            = (known after apply)%0A      + tags                   = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_security_group_ids = (known after apply)%0A%0A      + block_device_mappings {%0A          + device_name = "/dev/xvda"%0A%0A          + ebs {%0A              + iops        = (known after apply)%0A              + throughput  = (known after apply)%0A              + volume_size = 50%0A              + volume_type = "gp3"%0A            }%0A        }%0A%0A      + tag_specifications {%0A          + resource_type = "instance"%0A          + tags          = {%0A              + "Project" = "algosolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A      + tag_specifications {%0A          + resource_type = "volume"%0A          + tags          = {%0A              + "Project" = "algosolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A      + tag_specifications {%0A          + resource_type = "network-interface"%0A          + tags          = {%0A              + "Project" = "algosolved"%0A              + "Stage"   = "prod"%0A            }%0A        }%0A    }%0A%0A  # aws_security_group.algosolved-ec2-sg will be created%0A  + resource "aws_security_group" "algosolved-ec2-sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow vpc network"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow egress from all"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "allow ingress from all"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + name                   = "algosolved-ec2-sgp"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                 = "vpc-0f87a26ea18c1b807"%0A    }%0A%0APlan: 14 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + latest_ami_id = "ami-00dade17b7cbec931"%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-16T04:23:28.121Z [INFO]  Terraform version: 1.8.1%0A2024-05-16T04:23:28.121Z [INFO]  Go runtime version: go1.22.1%0A2024-05-16T04:23:28.121Z [INFO]  CLI args: []string{"/home/runner/work/_temp/096b7b69-47c4-40b8-ab91-4867c9620271/terraform-bin", "plan", "-no-color"}%0A2024-05-16T04:23:28.121Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-05-16T04:23:28.127Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=8c98de90-8582-9790-cb01-37998c726041 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-05-16T04:23:28.689Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=8c98de90-8582-9790-cb01-37998c726041 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-16T04:23:28.824Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=8c98de90-8582-9790-cb01-37998c726041 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-16T04:23:29.161Z [INFO]  backend/local: starting Plan operation%0A2024-05-16T04:23:29.745Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=fe65298f-ec28-b59c-8ac6-32da5b9b5172 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-16T04:23:30.048Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-16T04:23:30.137Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-16T04:23:30.137Z%0A2024-05-16T04:23:30.776Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-16T04:23:30.866Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-16T04:23:30.866Z%0A2024-05-16T04:23:30.996Z [INFO]  backend/local: plan calling Plan%0A2024-05-16T04:23:31.001Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-16T04:23:31.085Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-16T04:23:31.084Z%0A2024-05-16T04:23:31.195Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_rpc=ConfigureProvider tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=62ae2109-391b-8b4c-0010-d869c9d8f9a4 @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials timestamp=2024-05-16T04:23:31.195Z%0A2024-05-16T04:23:31.765Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=62ae2109-391b-8b4c-0010-d869c9d8f9a4 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws timestamp=2024-05-16T04:23:31.765Z%0A2024-05-16T04:23:31.777Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.scale_in_log_group, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A2024-05-16T04:23:31.778Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_rule.scale_in_rule, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .force_destroy: planned value cty.False for a non-computed attribute%0A      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute%0A2024-05-16T04:23:31.778Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_rule.scale_out_rule, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .force_destroy: planned value cty.False for a non-computed attribute%0A      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute%0A2024-05-16T04:23:31.778Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A2024-05-16T04:23:31.779Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_log_group.scale_out_log_group, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A2024-05-16T04:23:31.781Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow egress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})%0A      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal("allow ingress from all"), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("tcp"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})%0A2024-05-16T04:23:32.237Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.asg_management_policy during refresh.%0A      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)%0A2024-05-16T04:23:32.239Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.asg_management_policy, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A2024-05-16T04:23:32.246Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.rds_management_policy during refresh.%0A      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)%0A2024-05-16T04:23:32.248Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.rds_management_policy, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A2024-05-16T04:23:32.315Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.lambda_role during refresh.%0A      - .managed_policy_arns: actual set element cty.StringVal("arn:aws:iam::471112990651:policy/rds-management-policy") does not correlate with any element in plan%0A      - .managed_policy_arns: length changed from 1 to 2%0A2024-05-16T04:23:32.317Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.lambda_role, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .force_detach_policies: planned value cty.False for a non-computed attribute%0A      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .permissions_boundary: planned value cty.StringVal("") for a non-computed attribute%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A2024-05-16T04:23:32.323Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_in_lambda, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .publish: planned value cty.False for a non-computed attribute%0A      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute%0A      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute%0A      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-16T04:23:32.324Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_out_lambda, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute%0A      - .publish: planned value cty.False for a non-computed attribute%0A      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute%0A      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-16T04:23:32.327Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_target.scale_in_target, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute%0A2024-05-16T04:23:32.328Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_target.scale_out_target, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute%0A2024-05-16T04:23:32.765Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})%0A      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-16T04:23:32.778Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .force_delete: planned value cty.False for a non-computed attribute%0A      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute%0A      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute%0A      - .protect_from_scale_in: planned value cty.False for a non-computed attribute%0A      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute%0A      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute%0A      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute%0A      - .mixed_instances_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .traffic_source: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-16T04:23:32.791Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @mmmtobezip**